{"segments": [{"text": " What is up, guys? It's Andy Frisella, and this is the show for the real. Let's say goodbye to the lies, the fakeness, and delusions of modern society. Welcome to motherfucking reality. Guys, today we have Andy and DJ.", "start": 3.338, "end": 29.528}, {"text": " Cruz the motherfucking internet. That's what we're going to do. That's what CTI stands for. It stands for Cruz the internet. I didn't know if you guys could figure that out. But what we do here is we put topics on the screen. We speculate on what's true and what's not true. And then we talk about how we the people have to solve these problems that all these knuckleheads create. Let's just get right into it. We don't run ads on the show.", "start": 29.528, "end": 53.491}, {"text": " So we ask that you don't be a hoe. And you share the show. There you go. Yep. You're looking good, man. Is it? Damn. Yeah. I saw you trying to start work out, and I know what the fuck you're up to. What am I up to? Trying to fucking catch up and beat me. I can't let you.", "start": 55.229, "end": 71.328}, {"text": " I can't let you. I can't. Bro, you look good, man. Shit. Thanks, brother. I don't know if it might just be the sweater. I don't think it's the sweater, though. No, it's my face. Fuck, man. Hey. What's up? You tell me. You look good, too, bro. Thanks, man. Pull me down. Yeah. We had a big event this weekend. Dude, that was a big historic event.", "start": 72.88, "end": 95.628}, {"text": " Big Jim turns 80 years old yesterday. Shit. We went to dinner on Saturday. It was a good time. It was good. It was a good time, man. It's always nice. It's always nice. He was kind of surprised. You know, he's been around, man. It's hard to get him.", "start": 95.898, "end": 111.423}, {"text": " I mean, he's been around that many blocks. Yeah. I mean, he fought in the Civil War. He seemed to think it, too. That's for sure. Yeah. 80 years. Fuck, man. That's a long time. Yeah. Still moving, though. We ought to get him on the show, maybe. I mean, do an interview of his 80 years. Yeah. If you guys are ready for a six-hour podcast, let us know. That's the truth. It's going to be an all-day affair.", "start": 111.423, "end": 136.938}, {"text": " What else going on? It'll be fucking good, though, man. Oh, yeah. Everything is good, man. You know, everything is good. We got a lot to talk about. I bet. Yeah. I bet. Let's do some cruising. Let's do it. Before we get to our headlines, you know, I always try to throw a little special sauce in there for you. We just landed on the moon. Who did? We did. Me and you? No, like America. Oh. Yep. Lunar lander.", "start": 138.406, "end": 164.461}, {"text": " Firefly Blue Ghost. Lunar Lander touches down on the moon. This is the first time. Ever. I was going to say, I would believe this when chicks can have dicks. Bro, you can't look back at the fucking old footage. You cannot look back at the old footage. And be like, oh yeah, that's totally real.", "start": 164.832, "end": 188.525}, {"text": " You just can't. If you do, I got some ocean property in Arizona, bro. Bro. You just can't tell me that's real. I'm sorry. Listen, I believe this when chicks can have dicks. You know what I'm saying? Well, apparently they can. Well, one's more truer than the other, though. Did you see that study I sent you?", "start": 189.892, "end": 216.25}, {"text": " Oh, yeah, dude, that's sad. Bro, I sent DJ a study today, and they said that they ran some studies on people who actually transition. So one of the big arguments in gender transition is that before they transition, they have a likelihood suicide rate of, I think, like 48%. Right, and so doing the surgery saves their lives. Yes, that's the justification for these people. But now there's been a study that's come out", "start": 216.301, "end": 243.638}, {"text": " A recent study published in Oxford's. Yeah, well, you know Oxford. They don't know what they're doing. They trust science there. Oxford's Journal of Sexual Medicine sampling 107,000 people found that sex change surgery doubles depression rates among gender dysphoric individuals rather than reducing it. So it goes from 48 to 96. I ain't going mad. Who's counting, man? Yeah.", "start": 243.638, "end": 273.625}, {"text": " I would have never guessed. I would have never guessed that if you cut off your penis that eventually you're going to regret it. You're going to have some problems. I would never have guessed if you cut off your breasts, eventually you're going to regret it. I would have never guessed if you sewed your vagina shut and put a piece of skin from your leg as a penis that I would regret that. I mean, who would have known? Who would have known?", "start": 273.625, "end": 302.532}, {"text": " I mean, I'm shocked. Bro, I would be fucked up if I cut my penis off. First of all, it's a lot of cutting. But second of all. Not according to Alex at dinner the other night. Bullshit. No, bullshit. Bullshit. Yeah. What do you mean? What did I miss? Wait, what did she say? What'd she say? I don't know. She said something. I can't say it. I'll call her ass right now. Yeah.", "start": 303.342, "end": 322.664}, {"text": " No, I mean, but it makes sense, bro. You can't just do that shit, man. And here's the thing. It's common sense, bro. Oh, it is. But here's the thing. This is a relatively new thing in our society. And the problem is that they were able to spout all of these justifications. There wasn't enough time for these type of studies to even come through. You got to follow that shit out. You know what I'm saying? It takes some time to get a good base of evidence there.", "start": 322.664, "end": 351.79}, {"text": " And, yeah, so, I mean, it makes sense. But, yeah, so, I mean, Chicks with Dicks is more possible than going to the moon, though. Yeah. Yeah. The funniest thing about this, though, real quick, is so, you know, Buzz Aldrin? Yeah. I didn't know he was still alive. He's still alive. Is he? And they got to show him what it actually looks like to land on the moon for the first time. It reports lunar gravity, and it is stable. Come on. That's fake, too.", "start": 351.79, "end": 378.638}, {"text": " He's like, shit, so that's what it really looks like. Here's a picture they supplied. This is supposed to be... Who took the picture? I don't know. Yeah.", "start": 380.174, "end": 404.761}, {"text": " Anyway, we all know the government's liars, and we all know NASA's liars, and we all know it's a massive money laundering scheme, just like all the other shit. How many billions of dollars are pumped through NASA and then filtered back through different SPFs and perks and donations and funding?", "start": 406.246, "end": 424.201}, {"text": " Yeah, I mean, I was wondering, I wonder if they do, like, any real, like, you know, crazy shit, like, you know, like, if they fuck with, like, any aliens or something, you know what I'm saying? Like, that maybe is the front. Like, it's a front for something. Like, I'm a firm believer that... I just said what it was a front for. It's a front for these people to get rich, bro. Yeah, but, like, I think originally, like, the whole reason we even did that was to, like, fucking, you know, funnel the money to cover up the fucking Cold War and shit, you know? I don't know.", "start": 424.201, "end": 447.877}, {"text": " Beat the Russians, you know? Well, that was the original motivation. But nobody went. That's right. Nobody fucking went, bro. They faked it so that they could demoralize the Russians during the Cold War. I mean, that's what that was about. That was the basis of it, yeah. Race to the moon. Yep. We'll beat you. Out here in Arizona, you might as well stop.", "start": 447.877, "end": 471.974}, {"text": " Yeah, man. It is what it is, man. But guys, hope you're ready for a show. Remember, if you wanted to see any of these pictures, articles, links, videos, go to andyfrasella.com. You want to make people real mad? What? You tell them that the earth isn't flat. Oh, fuck. Now, hold on. Now, you listen. The flat earthers are fucking passionate about it. No, listen. I mean, there's an argument. No, there's not. There's an argument, bro. We've been up in planes. What does it look like?", "start": 472.227, "end": 496.915}, {"text": " You've seen what I've seen. I'm just saying, bro, 40,000 feet up. You motherfuckers think the Earth's flat? Joe does. Joe Young does. I know Joe Young does. Yeah, bro, we're ice shelfers. I think ice shelf could be true. No, if that's true, then the Earth's flat. No. Yeah. No. Ice shelf theory is not about flat Earth.", "start": 501.674, "end": 525.535}, {"text": " No, I'm not saying it is. I'm saying if that is true, though, then it would have to be true. No, there's still going to be some curvature. It's like a fishbowl. No, it's like the top crown of somebody with a bald head. Like you. If you just drew a little circle on your hat. You wore one of them little hats, you know, those little tiny ones on your head. The pointy ones or the... No, the little ones. You know, those little round hats.", "start": 526.278, "end": 549.903}, {"text": " A condom, Andy? What are you talking about? What kind of hat on my head? You know. All right. Anyway. Yeah, man. Hey, listen. Go to Andy.com. Yeah. Go to AndyForSeller.com.", "start": 553.717, "end": 566.761}, {"text": " I wonder where it takes you to Andy.com. Is that a real thing? Let's get into our headlines, man. We got some interesting stuff. Let's start with first series of headlines. Headline number one. I wanted to get into this, and this may be some foreshadowing going on. I don't know, but I saw it, and I immediately felt that this is not good.", "start": 567.2, "end": 587.635}, {"text": " So J.D. Vance went to a ski trip or tried to go to a ski trip. And this was supposed to be like, you know, like usually they don't announce the vacation shit until like, you know, he's already there or they're gone. Right. Like that's a typical security thing. Right. I mean, hell, we don't really post where we are when we're there. We post it after on the fucking plane ride home. You know what I'm saying? Like that's a typical thing. Right. And so J.D. Vance was supposed to be taking his family to this ski resort in Vermont.", "start": 587.635, "end": 616.762}, {"text": " And before he even got there, I don't know if you guys saw this, there was some people counted 500 fucking protesters that were already there. All right. Now, I mean, DJ, what's the big deal here? Well, if you got, I mean, first of all, people don't understand.", "start": 616.762, "end": 636.067}, {"text": " The level of logistics that has to go into organizing even a couple of hundred people together at the same time to get them into a specific location ahead of time. This spells there is a fucking leak on his detail that needs to be removed.", "start": 636.387, "end": 649.82}, {"text": " There's no way. How would they know that information ahead of time to even organize 500 fucking people? Yeah, there's somebody in logistics leaking information. Leaking that shit out, bro. And like I said, it wasn't a couple, bro. It was a shit ton of them. Vance is a traitor. Go ski in Russia. Vance equals Putin's pawn equals traitor. So, dude, these people...", "start": 650.798, "end": 675.166}, {"text": " think that putin is the problem all the while people are being arrested for making social media posts all through europe okay we have migrant gangs attacking women and raping women and stabbing people and killing them who aren't european", "start": 675.79, "end": 692.294}, {"text": " Okay? We have people being arrested for praying in their homes already. Okay? And these people are terrified of Vladimir Putin when all of this shit is already happening? Going on around them. Yeah, right. Like, what are you guys fighting for? You know, these people have been drinking this Kool-Aid their whole lives from the media, and they can't figure out that they've been lied to about fucking everything.", "start": 692.834, "end": 719.581}, {"text": " All right. And, dude, did you see that that comment I got from I told I did I show you that comment I got from one of the people who follows me about the Ukraine shit? Yeah. He's like Ukraine's a sovereign nation. And, you know, we as the most powerful country in the world have a responsibility to stick up for countries that can't defend themselves. Well, let me stop you right there, homie. No, we don't.", "start": 719.885, "end": 743.763}, {"text": " We don't have a responsibility to stand up for anybody but Americans. And the truth of the matter is, is America first means America first. It means zero dollars to them until we are good and we are not good. OK, on top of that, we are now getting drug into.", "start": 743.763, "end": 764.35}, {"text": " An actual war because of our involvement with NATO. They're sending troops in. They would rather blow up the entire world than to have the truth about the entire fucking system that oppresses citizens globally to come out and how they do it. Yeah, right. Right. But they're supposed to be, you know, the people of peace and love and tolerance. And here we are. It's insane, dude. World War III on the doorstep. Yeah. For what reason? For what reason? What reason?", "start": 765.65, "end": 794.236}, {"text": " The only reason that these people all want this war, I'm not talking about these morons. I'm talking about the people who are actually making the decisions. Who write the shit on paper. Yes, who are sending other people's children to die. The only reason they want to do that is because they don't want the truth to come out about how all these nations collaborate to oppress the citizens of humanity.", "start": 794.962, "end": 816.41}, {"text": " Yep, 100%, man. Like I said, I saw this and I just foreshadowing, bro. This is some dangerous shit. And they definitely need to lock that shit in. You know what I'm saying? Because we've seen what happens when you have leaks in your security team twice now with Donald Trump. I mean, fuck. J.D. Vance obviously being an incumbent potential running candidate for 2028. I mean, bro, like, I mean, be a good way to get him out beforehand. They got somebody fucking in this team. I'm telling you right now. 100%, dude. There's no doubt.", "start": 816.882, "end": 845.57}, {"text": " They need to watch it. Listen, this administration is still full with rats. It's still full of people who aren't on the side of the citizens. You know, it's still full of this.", "start": 845.57, "end": 858.395}, {"text": " Yeah. Well, so what kicked off all of this Putin nonsense? We got to go back a couple of days to this meeting that happened with Trump, Vance, and Zelensky of Ukraine. Now, I will say this, because we got plenty of criticism to give out here today on Trump and the Trump administration. Look what these people call him, dude. Protester held sign labeling Vance a traitor and Nazi scum. You motherfuckers don't even know anything about Nazi.", "start": 858.479, "end": 886.559}, {"text": " You don't know it. And you keep calling people Nazis, which is just emboldening people to come out with polarizing viewpoints. It's the same thing they did with racism. Yeah, dude, exactly. And now people are like, well, you know what?", "start": 886.559, "end": 899.587}, {"text": " Black people do steal shit. Yeah. Bro, no. You know what? It's almost good that they do this because they devalue their defense mechanism. Well, their offense mechanism, right? Shut the fuck up or you're a Nazi. Shut the fuck up or you're a racist. And that shit ain't working anymore. No one cares. And it just exposed how radical they are. Yes. And what the truth that they actually are trying to push behind. Well, unfortunately.", "start": 900.683, "end": 927.565}, {"text": " also it brings to the surface the element that they claim to want to suppress. You know, when you call everybody racist for 20 fucking years, eventually they're like, yeah, you know what? I am because I'm tired of getting called this and this and this from you fuckers. Fuck you. Simply fuck you. And what happens is they end up radicalizing people", "start": 927.565, "end": 952.962}, {"text": " It works the opposite of what they want. They end up radicalizing people that would otherwise just be normal. Normal people. You know, and dude, that's a fucking bad thing. That's not good for society. Like, I don't buy into this shit here in the United States of America that, you know, and I don't buy into it in humanity either.", "start": 953.57, "end": 973.516}, {"text": " I don't care if someone's Japanese or Chinese or this or that or this. And maybe I'm ignorant and maybe I'm naive by not caring about that. Because it seems like every other fucking race of people gives a lot of fucks about their own race. And, you know, being a white guy that was raised in the United States of America, I've been told that I was a fucking problem pretty much my whole fucking life. So I never made my race my identity. I never said, yeah, I'm fucking proud to be white. That was never a thing.", "start": 973.516, "end": 1001.613}, {"text": " i was always looking at everybody else just like mlk says dude the content of their character who they are you know and i think most people are like that and i think we're getting to a point where", "start": 1001.613, "end": 1013.105}, {"text": " You know, everybody's coming back to that, and these people who are calling all the names are going to be ostracized. Like, nobody's listening to this shit. We're fucking Nazi. Bro, you don't even know anything about the history of fucking Nazi movement. You don't know anything of the history of World War I or World War II or how the Federal Reserve was formed. You don't know what the fuck you're talking about, period.", "start": 1013.223, "end": 1037.236}, {"text": " That's just it. No, it's stupid. They don't know. And they use these fucking terms, dude. I'm going to tell you what, man. I get called every name in the book now. I don't care. I like smile. I wear them as badges of honor. Yeah, well, dude, why do you think Kanye's got a fucking swastika t-shirt? Because he's basically saying, well, fuck you.", "start": 1038.367, "end": 1058.92}, {"text": " And you guys can get mad about that all you want, but he's forcing you to pay attention. And then when you look at the symbol and the history of a swastika, you start to realize that it's been used for 12,000 years. And it's actually meant to be good luck and good fortune and prosperity through human history. And it wasn't until Adolf Hitler used that. Now, by the way, why do you think he used that?", "start": 1059.173, "end": 1081.921}, {"text": " Do you think he used that to represent evil? In his mind, that's what he was fighting for. He was, in his mind, he was fighting for what that symbol actually meant. And then since then, that symbol has been, you know, you can't fucking use it or you're a Nazi. Well, bro, if you go to Eastern cultures, it's everywhere. It's on the buildings. It's, I mean, it's still, is that not true, Syed? That's right. Yeah. So, like...", "start": 1081.921, "end": 1108.87}, {"text": " You know, my point in all of this, saying this, is like, these motherfuckers don't even know that. No. And it's like, and dude, let's pay attention. Who are these people? Who are they? What race are they? Oh, they're all white. Oh, they're all white. And what gender are they? All women. And what age are they?", "start": 1108.87, "end": 1129.863}, {"text": " I mean, they're bruncher age for sure. And what are they wearing? Oh, they're wearing North Face, and they're wearing fucking $400 jackets. Right, right. Well, I guarantee you a lot of them probably just got laid off from USAID. Yeah, for sure. Listen, this group of people.", "start": 1130.318, "end": 1149.877}, {"text": " is legitimately the worst group of people when they start to talk about society's issues because they are so privileged. They don't have any worries. They fucking live in upper middle class areas and they drink champagne on Sundays. And then they want to seem virtuous by caring because they don't have any other meaning in their life. And by the way, if you want to seem virtuous and care, stand up for the fucking right thing. Or actually go to Ukraine. Go fight in fucking Ukraine. I don't want to hear it, dude.", "start": 1149.877, "end": 1179.408}, {"text": " I don't give a fuck. You know what? I'm America first. Period. I don't give a fuck if it's Ukraine, if it's Israel, or anybody else. Here first, then there. And we have a lot of fucking work to do here before we should ever even consider giving a fucking dollar to anybody else. Doesn't matter who it is. And, by the way, if a country can't defend itself, well then maybe they should fucking work on that.", "start": 1179.408, "end": 1204.332}, {"text": " Makes sense to me, man. But guys, let's slow this down. Let's talk about how we even got to having these protests. You know why the United States funds all these countries? Do you know why? Because we have to. No. That's not why.", "start": 1204.332, "end": 1217.208}, {"text": " The United States adopted a strategy a long time ago. They golden handcuffed these countries, okay? So they either say, hey, we'll give you this aid, but you can't make this and this and this and this and this as part of the agreement, right? Can't make these weapons, can't do this thing. Or they give them the money knowing that...", "start": 1218.406, "end": 1237.998}, {"text": " The United States has their back and sort of handicaps them from any innovation. Any prosperity. Any innovation. Because they're getting their money from an outside source. It's no different than a rich kid. Okay? You got a little rich kid whose dad and mom keep giving him money, keep giving him money, keep giving him money, keep giving him money, keep giving him money. Do you think that kid's going to ever learn how to operate in reality? No. Now, take that concept and apply it to a country. Okay? If you keep foreign aiding a country... What I'm saying here is that...", "start": 1237.998, "end": 1266.5}, {"text": " We do this to handicap the other countries intentionally. And it needs to fucking stop. Yeah, bro. Take them off the teat, bro. Make them learn how to get the food themselves. Get strong or get conquered. I don't give a fuck. I don't care. I'm American, bro. I care about us first. Do I care about people in Europe? Yeah, I got friends in Europe. Do I care about people in Australia? Yeah, I do. Do I care about them more than us? No, sorry, I don't. I care about us.", "start": 1266.5, "end": 1291.559}, {"text": " Yeah, 100%, bro. But yeah, let's slow this down. Let's see where this all started because we got to go back a couple of days to a meeting that Trump, Vance, and Zelensky had at the White House. And this was the first time we got to really see any type of negotiations, I guess, with the press corps being there.", "start": 1292.099, "end": 1308.535}, {"text": " which I believe was part of Trump's play. I mean, obviously, because apparently word on the street is that this is exactly how Zelensky was behind cameras. And then Trump made the cameras available and everybody got to see his true colors. So let's check this clip out.", "start": 1308.535, "end": 1324.735}, {"text": " I'm talking about the kind of diplomacy that's going to end the destruction of your country. Yes, but if you are not strong... Mr. President, with respect, I think it's disrespectful for you to come into the Oval Office and try to litigate this in front of the American media. Right now, you guys are going around and forcing conscripts to the front lines because you have manpower problems. You should be thanking the President to bring an end to this conflict. Have you ever been to Ukraine that you say what problems we have?", "start": 1325.36, "end": 1349.103}, {"text": " I have actually watched and seen the stories, and I know what happens is you bring people, you bring them on a propaganda tour, Mr. President. Do you disagree that you've had problems bringing people into your military? And do you think that it's respectful to come to the Oval Office of the United States of America and attack the administration that is trying to prevent the destruction of your country? A lot of questions. Let's start from the beginning. First of all, during the war,", "start": 1349.103, "end": 1378.634}, {"text": " Everybody has problems. Even you. But you have nice ocean. And don't feel now. But you will feel it in the future. God bless. You don't know that. God bless. God bless. You will not have the war. Don't tell us what we're going to feel. Bro, that was a threat. Hold on. Stop it. Don't tell us what we're going to feel. That was a fucking threat. 100%. That was a fucking threat. 100%.", "start": 1378.634, "end": 1400.15}, {"text": " Fuck this little motherfucker. Throw him in the fucking wood chipper right there and the war ends. Nobody in Ukraine wants this war. This motherfucker wants the war because him and his fucking homies are stealing all the money. You get paid.", "start": 1400.588, "end": 1415.759}, {"text": " Get paid, bro. That was a fucking... Bro, you're sitting in the Oval Office. What I love about this, though, is I love how Trump is... Immediately? No. I love how Trump's sitting. He's letting him talk. Yeah. Let's him talk. Let's him talk. Let's him talk. Let's him talk. The guy gets one inch out of line, and he said, hold on. And then let's play the rest. It fucking hammers him, bro. Tell us what we're going to feel. I'm not telling you. Because you're in no position to dictate that. Remember this. You're in no position to dictate what we're going to feel.", "start": 1415.759, "end": 1444.463}, {"text": " We're going to feel very good. We're going to feel very good and very strong. You're right now not in a very good position. You've allowed yourself to be in a very bad position, and he happens to be right about it. You're not in a good position. You don't have the cards right now.", "start": 1444.463, "end": 1462.3}, {"text": " With us, you start having cards. Right now, you're playing cards. You're playing cards. You're gambling with the lives of millions of people. You're gambling with World War III. You're gambling with World War III. And what you're doing is very disrespectful to the country, this country. It's back to you. Far more than a lot of people said they should have. Have you said thank you once?", "start": 1462.3, "end": 1487.275}, {"text": " A lot of times. Even today. You went to Pennsylvania and campaigned for the opposition in October. Offer some words of appreciation for the United States of America and the president who's trying to save your country. And your life.", "start": 1487.275, "end": 1505.112}, {"text": " Look, dude, he's dead anyway. They're going to kill this dude. Bro, listen. Either side's going to do it. Yeah, for sure. Yeah, he's getting killed. This guy's fucking done. They can't let that dude walk knowing what he knows, bro. No, not only that. No, he stole. Dude, he knows where all the money went. He knows exactly where it went. You know what I'm saying? They can't let that dude walk.", "start": 1505.602, "end": 1522.409}, {"text": " Yeah, see, you know, we call it how we see it. A lot of people here on the internet, you know, like a lot of people were upset I saw this. Like, you know, I'm so embarrassed to be an American. Listen, dude, you've never done anything that fucking matters, okay? Real talk. You've never had to fight for anything. You've never had to negotiate for anything. This is extremely normal conversation in any business environment amongst men, okay?", "start": 1522.409, "end": 1551.367}, {"text": " When people step out of line, you step on their fucking face. And that's what Trump does. He's very respectful until that man gets disrespectful. He just threatened our country, bro. Dude, and we got people in this country. What are we going to feel if we don't help? Brother, first of all, we got people in this country that fucking are on his side.", "start": 1551.367, "end": 1571.127}, {"text": " Like, bro, if you're on this dude's side over our side, fuck off. Go over there. Go live in Europe. Go live in Ukraine. They'll take you. And then they'll take you to the front lines like they're taking people with Down syndrome to the front fucking lines. Bro, I saw that clip. All you motherfuckers talking all this shit. You don't know what you're talking about, dude. You have no idea. You haven't been paying attention. You're sucked into your own life. You're watching the Kardashians and all this other fucking fake-ass bullshit.", "start": 1571.313, "end": 1599.815}, {"text": " And then you spout off about how this is embarrassing. You know what? You weren't embarrassed when our country was run by a literal vegetable. You weren't embarrassed when...", "start": 1599.815, "end": 1611.323}, {"text": " They stole all your money and closed your businesses and fucked with you. You weren't embarrassed when our whole country is a laughingstock of the entire world because we're over here with a couple of fucking morons running our country. Trans titties on the front line. Bro, we got trans generals and we got kids. We're promoting kids cutting off their dick and everybody else in the world is like...", "start": 1611.475, "end": 1633.97}, {"text": " The fuck is going on in the U.S.? You weren't embarrassed about that shit, but you're embarrassed about this man and this other man who have finally said, no, you're not going to fucking do this shit here, okay? I actually thought, in my opinion, that was the coolest, baddest-ass, gangster-ass shit that I've ever seen from either one of those guys. That's for sure, bro. So if you don't like it and that's embarrassing to you, then maybe you should fucking move.", "start": 1634.493, "end": 1662.168}, {"text": " Maybe you should move because this is how we do things here. And by the way, I don't jockey on Trump's balls, okay? I call it how I see it. If he does good, he does good. If he does bad, he does bad. That's great. That's not good. That's great. That's great. Okay? This motherfucker's stealing your money. You guys are out here working, and that's the problem. A lot of these people that are on, they're not working, right? So they don't see that tax be taken out of their check. And then think about it going over to this guy so he can buy.", "start": 1662.168, "end": 1692.02}, {"text": " Four different mansions and fucking a yacht and two Bugattis. He's got two bugs? Yeah. Damn. Are they cool, though? I mean, have you seen a bad Bugatti? Yeah, that's true. That's fair.", "start": 1692.02, "end": 1704.541}, {"text": " I'm just saying, dude, like that's not. That's not okay. No, it's cool for me to have to. You know what I'm saying? But I didn't, you know, I didn't steal your fucking tax dollars to do it. Exactly. You know, like, dude, fuck this guy. Yeah. No, I mean, well, so this is what started that whole chain of events, right? So you got. I hate this motherfucker. Oh, bro, I can't stand him. And I can't stand people standing up for him. It's so, it's stupid shit.", "start": 1704.625, "end": 1727.71}, {"text": " But after he left the Oval Office, he decided to go back to Europe, and he did a little tour. Did you hear what he said today? About our kids? Our troops. You got that clip? I can put it in. Bro, this guy gets on television today. You don't have to get it in there, but you guys can look it up.", "start": 1727.71, "end": 1747.842}, {"text": " This guy gets on TV today. Today is Monday. You're hearing this on Tuesday. And he fucking says, the United States is going to have to send its sons and daughters to fight in Ukraine, and they will die. That's what he said, his almost verbatim exact quote. Dude, if we send a single soldier over there, like a single fucking soldier, this administration is no different than any other one. 100%. Yeah. Yeah, 100%, man.", "start": 1748.669, "end": 1776.715}, {"text": " But yeah, I mean he goes over it goes back to Europe and decides to do this little tour So he stopped to stop in the UK He went to the UK first. He went to the UK to get some of that terrible food. They got over there Gordon Ramsay's the only one knows how to make food over there That's why he's so fucking famous, bro That's why Gordon Ramsay's so famous because he's the only one over there who knows how to make food", "start": 1776.867, "end": 1800.83}], "language": "en"}